#### BoundaryConditionsType Enumeration

---

|  |
| --- |
| See Also |

This enum declares type of BoundaryConditions.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum BoundaryConditionsType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BoundaryConditionsType ``` |

| Visual C++ |
| --- |
| ``` public enum class BoundaryConditionsType ``` |

# Members

| Member name | Description |
| --- | --- |
| Point | Point Boundary Conditions |
| Line | Line Boundary Conditions |
| Area | Area Boundary Conditions |

# See Also

Autodesk.Revit.DB.Structure Namespace